src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/торо_ЗаявкаНаРемонт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="145aacdb-f868-47fa-a11a-64c1ee401e0c">
  <name>торо_ЗаявкаНаРемонт</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="0897f476-6166-46f5-b06b-269173e4520e">
    <name>проф_СтатусСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="03e32b56-c47c-4bc5-93ac-0da2e38d3c38">
    <name>проф_Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e09e8e0e-2544-4812-8554-4a3ee2dc14b2">
    <name>проф_НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7ed39b61-bbcb-4d6e-853d-79611e8e5aff">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f6af02a-4b40-4613-8cc7-8b4a64e0e244">
    <name>РемонтыОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ccc4499d-64f9-48a4-98c6-612249fc206f">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="45912545-c381-435b-9239-8860ec2db3af">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cfe/src/Catalogs/проф_Назначения/проф_Назначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9ffd7683-e584-474a-b265-31df63ffc5a9">
  <name>проф_Назначения</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="710428d6-cf35-40d5-ba2f-b8358d3e48d1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ac1cff61-ca3f-43ba-98e8-a73eede81b43">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fe2cc228-8fb0-4209-9c64-f8d7349cf1a0">
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d873557d-2cd2-49b8-b9b9-ba74907ab271">
    <name>ДвиженияПоСкладскимРегистрам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfcd486f-ce81-4d09-95fb-ac1dc450ccc2">
    <name>КонтролироватьТолькоНаличие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0005b69f-a259-4c75-ac02-65ccc9e14578">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2635dfe1-50d3-44bc-b327-52eaf52f459d">
    <name>ТипНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b2e17e5-1e7a-4d58-a2ee-2b5810f1fb86">
    <name>ТипОбъектаНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30556ed4-3c87-4803-9f56-54b8640f13fa">
    <name>CostCode</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d17a6c84-8090-4a0b-be0c-41c4f0e1e94b">
    <name>ИДЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/toir_cfe/src/Documents/торо_ЗаявкаНаРемонт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&После("ДобавитьКомандыПечати")
Процедура проф_ДобавитьКомандыПечати(КомандыПечати)
	//++ Проф-ИТ, #76, Лавриненко Т.В.,11.09.2023
	// Карта ТО АТ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "проф_КартаТОАТ";
	КомандаПечати.Представление = НСтр("ru = 'Карта ТО АТ'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР", "ПечатьДокументовБезПредварительногоПросмотра", Ложь);
    //-- Проф-ИТ, #76, Лавриненко Т.В.,11.09.2023   
	
	//++ Проф-ИТ, #130, Лавриненко Т.В.,12.09.2023
	// Карта ТО АТ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "проф_КартаТОДСТ";
	КомандаПечати.Представление = НСтр("ru = 'Карта ТО ДСТ'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР", "ПечатьДокументовБезПредварительногоПросмотра", Ложь);
    //-- Проф-ИТ, #130, Лавриненко Т.В.,12.09.2023
	
	//++ Проф-ИТ, #131, Остапенко Е.В., 15.09.2023
	// Ремонтный лист
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "проф_РемонтныйЛист";
	КомандаПечати.Представление = НСтр("ru = 'Ремонтный лист'");
	КомандаПечати.Обработчик = "торо_Печать.ЗапроситьУПользователяДополнительныеПараметрыПередПечатью";
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР", "ПечатьДокументовБезПредварительногоПросмотра", Ложь);
	//-- Проф-ИТ, #131, Остапенко Е.В., 15.09.2023
	
	//++ Проф-ИТ, #323, Соловьев А.А., 03.11.2023
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.торо_ЗаявкаНаРемонт";
	КомандаПечати.Идентификатор = "проф_РемонтныйЛистСводно";
	КомандаПечати.Представление = НСтр("ru = 'Ремонтный лист (сводно)'");
	КомандаПечати.СразуНаПринтер = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить(
		"НастройкиТОиР", "ПечатьДокументовБезПредварительногоПросмотра", Ложь);
	//-- Проф-ИТ, #323, Соловьев А.А., 03.11.2023
	
КонецПроцедуры

&После("Печать")
Процедура проф_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	//++ Проф-ИТ, #76, Лавриненко Т.В.,11.09.2023
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "проф_КартаТОАТ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"проф_КартаТОАТ", 
			"Карта ТО АТ", 
			проф_ПечатьКартаТОАТ(МассивОбъектов, ПараметрыПечати),
			,
			"Документ.торо_ЗаявкаНаРемонт.проф_КартаТОАТ");		
	КонецЕсли; 
    //-- Проф-ИТ, #76, Лавриненко Т.В.,11.09.2023  
	
	//++ Проф-ИТ, #130, Лавриненко Т.В.,12.09.2023
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "проф_КартаТОДСТ") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"проф_КартаТОДСТ", 
			"Карта ТО ДСТ", 
			проф_ПечатьКартаТОДСТ(МассивОбъектов, ПараметрыПечати),
			,
			"Документ.торо_ЗаявкаНаРемонт.проф_КартаТОДСТ");		
	КонецЕсли; 
    //-- Проф-ИТ, #130, Лавриненко Т.В.,12.09.2023 
	
	//++ Проф-ИТ, #131, Остапенко Е.В., 15.09.2023
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "проф_РемонтныйЛист") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"проф_РемонтныйЛист", 
			"Ремонтный лист", 
			проф_ПечатьРемонтныйЛист(МассивОбъектов, ПараметрыПечати),
			,
			"Документ.торо_ЗаявкаНаРемонт.проф_РемонтныйЛист");		
	КонецЕсли;
	//++ Проф-ИТ, #131, Остапенко Е.В., 15.09.2023
	
	//++ Проф-ИТ, #323, Соловьев А.А., 03.11.2023
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "проф_РемонтныйЛистСводно") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
			"проф_РемонтныйЛистСводно", 
			"Ремонтный лист (сводно)", 
			проф_ПечатьРемонтныйЛистСводно(МассивОбъектов, ПараметрыПечати),
			,
			"Документ.торо_ЗаявкаНаРемонт.проф_РемонтныйЛист");
	КонецЕсли;
	//-- Проф-ИТ, #323, Соловьев А.А., 03.11.2023
КонецПроцедуры 

//++ Проф-ИТ, #76, Лавриненко Т.В.,11.09.2023
 Функция проф_ПечатьКартаТОАТ(МассивОбъектов, ПараметрыПечати) 
	
	ОбработкаПечати = Обработки.проф_ПечатьКартаТОАТ.Создать();
	Возврат ОбработкаПечати.ПечатьКартаТОАТ(МассивОбъектов, ПараметрыПечати);
		
КонецФункции
//-- Проф-ИТ, #76, Лавриненко Т.В.,11.09.2023

//++ Проф-ИТ, #130, Лавриненко Т.В.,12.09.2023
 Функция проф_ПечатьКартаТОДСТ(МассивОбъектов, ПараметрыПечати) 
	
	ОбработкаПечати = Обработки.проф_ПечатьКартаТОДСТ.Создать();
	Возврат ОбработкаПечати.ПечатьКартаТОДСТ(МассивОбъектов, ПараметрыПечати);
		
КонецФункции
//-- Проф-ИТ, #130, Лавриненко Т.В.,12.09.2023 

//++ Проф-ИТ, #131, Остапенко Е.В., 15.09.2023
Функция проф_ПечатьРемонтныйЛист(МассивОбъектов, ПараметрыПечати) 
	
	ОбработкаПечати = Обработки.проф_ПечатьРемонтныйЛист.Создать();
	Возврат ОбработкаПечати.ПечатьРемонтныйЛист(МассивОбъектов, ПараметрыПечати);
		
КонецФункции
//++ Проф-ИТ, #131, Остапенко Е.В., 15.09.2023

//++ Проф-ИТ, #323, Соловьев А.А., 03.11.2023
Функция проф_ПечатьРемонтныйЛистСводно(МассивОбъектов, ПараметрыПечати) 
	
	ОбработкаПечати = Обработки.проф_ПечатьРемонтныйЛист.Создать();
	Возврат ОбработкаПечати.ПечатьРемонтныйЛистСводно(МассивОбъектов, ПараметрыПечати);
	
КонецФункции
//-- Проф-ИТ, #323, Соловьев А.А., 03.11.2023

#КонецОбласти

//++ Проф-ИТ, #359, Соловьев А.А., 23.11.2023
#Область Назначения

// Возвращает шаблон для генерации назначения товаров в документе.
//
// Параметры:
// 		Объект - ДокументОбъект.ЗаказНаРемонт, ДанныеФормыСтруктура - заказ на ремонт, по которому необходимо получить шаблон назначения.
//
// Возвращаемое значение:
// 		См. Справочники.Назначения.ШаблонНового
//
Функция ШаблонНазначения(Объект) Экспорт
	
	ШаблонНазначения = Справочники.проф_Назначения.ШаблонНового();
	
	ШаблонНазначения.НаправлениеДеятельности = Объект.проф_НаправлениеДеятельности;
	
	ШаблонНазначения.Заказ = Объект.Ссылка;
	
	Возврат ШаблонНазначения;
	
КонецФункции

Функция ЭтоНаправлениеДеятельностиСОбособлениемТоваровИРабот(Ссылка) Экспорт
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "УчетЗатрат");
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
//-- Проф-ИТ, #359, Соловьев А.А., 23.11.2023

#КонецЕсли
